reedited some stuff
